dinga1981/esp8266-ai/firmware/src/main.cpp
// ---------- stock watchlist screen ----------

bool handleStockPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload)) return false;
  JsonArray arr = doc["stocks"];
  stockCount = 0;
  for (JsonObject s : arr) {
    if (stockCount >= MAX_STOCKS) break;
    stocks[stockCount].code = s["code"] | "";
    stocks[stockCount].price = s["price"] | "";
    stocks[stockCount].pct = s["pct"] | "";
    stocks[stockCount].up = s["up"] | 0;
    stockCount++;
  }
  stockNamesRev = doc["names_rev"] | -1;
  stockEverLoaded = true;
  stockDirty = true;
  return true;
}

// Streams the Mac-rendered name strips and blits one per row (top line,
// right of the ASCII code). Wired-only mode has no HTTP: codes still show.
bool drawStockNames() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock/names.raw";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  uint8_t cnt = 0;
  if (stream->readBytes(&cnt, 1) != 1) {
    http.end();
    return false;
  }
  const size_t rowBytes = (size_t)STOCK_NAME_W * 2;
  bool ok = true;
  for (int i = 0; i < cnt && ok; i++) {
    int y0 = 10 + i * 54;
    for (int r = 0; r < STOCK_NAME_H; r++) {
      if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
        ok = false;
        break;
      }
      if (i < stockCount) tft.pushImage(70, y0 + r, STOCK_NAME_W, 1, rowBuf);
      yield();
    }
  }
  http.end();
  return ok;
}

void pollStock() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleStockPayload(http.getString());
  http.end();
}

// 54px per row: small grey code on top, big font-4 price (white) on the left
// and change% on the right - red rising / green falling (CN convention).
// Rows repaint only when their text changes, same trick as everywhere else.
void drawStockScreen() {
  if (!stockChromeDrawn) {
    tft.fillScreen(TFT_BLACK);
    stockChromeDrawn = true;
    for (int i = 0; i < MAX_STOCKS; i++) {
      stockLastCode[i] = "\x01"; // force repaint
      stockLastVal[i] = "\x01";
    }
    stockNamesDrawnRev = -1;
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(0x7BEF, TFT_BLACK);
    tft.drawString("STOCKS", SCREEN_CX, 228, 1);
  }
  stockDirty = false;

  if (stockCount == 0) {
    if (stockLastCode[0] != "") {
      for (int i = 0; i < MAX_STOCKS; i++) {
        stockLastCode[i] = "";
        stockLastVal[i] = "";
      }
      tft.fillRect(0, 0, SCREEN_W, 226, TFT_BLACK);
      tft.setTextDatum(TC_DATUM);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.drawString(stockEverLoaded ? "No stocks configured" : "Waiting for bridge...", SCREEN_CX, 100, 2);
      if (stockEverLoaded) tft.drawString("Mac menu: Set watchlist", SCREEN_CX, 124, 2);
    }
    return;
  }

  for (int i = 0; i < MAX_STOCKS; i++) {
    int y0 = 10 + i * 54;
    bool has = i < stockCount;
    // top line (code + name strip) and value line refresh independently, so
    // a price tick never wipes the name bitmap
    String codeKey = has ? stocks[i].code : "";
    if (codeKey != stockLastCode[i]) {
      stockLastCode[i] = codeKey;
      tft.fillRect(0, y0, SCREEN_W, 17, TFT_BLACK);
      stockNamesDrawnRev = -1; // strip area wiped: re-fetch names
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(0x7BEF, TFT_BLACK);
        tft.drawString(stocks[i].code, 14, y0, 2);
      }
    }
    String valKey = has ? stocks[i].price + "|" + stocks[i].pct + "|" + String(stocks[i].up) : "";
    if (valKey != stockLastVal[i]) {
      stockLastVal[i] = valKey;
      tft.fillRect(0, y0 + 18, SCREEN_W, 36, TFT_BLACK); // value line + inter-row gap
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawString(stocks[i].price, 14, y0 + 18, 4);
        uint16_t pc = stocks[i].up > 0 ? TFT_RED : (stocks[i].up < 0 ? TFT_GREEN : TFT_LIGHTGREY);
        tft.setTextDatum(TR_DATUM);
        tft.setTextColor(pc, TFT_BLACK);
        tft.drawString(stocks[i].pct, 226, y0 + 18, 4);
      }
    }
  }

  // CJK name strips, re-fetched when the watchlist (names_rev) changes
  if (stockNamesRev >= 0 && stockNamesDrawnRev != stockNamesRev) {
    if (drawStockNames()) stockNamesDrawnRev = stockNamesRev;
  }
}

// ---------- date + weather screen ----------

bool handleWeatherPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload)) return false;
  const time_t serverUnix = doc["server_unix"] | (time_t)0;
  if (serverUnix > 0) {
    weather.serverUnix = serverUnix;
    weather.syncedAtMs = millis();
    weather.utcOffsetSeconds = doc["utc_offset_seconds"] | (long)(8 * 3600);
    weather.scheduleUtcOffsetSeconds = doc["schedule_utc_offset_seconds"] |
                                       weather.utcOffsetSeconds;
  }
  weather.valid = doc["valid"] | false;
  weather.stale = doc["stale"] | true;
  if (weather.valid) {
    weather.currentTemp = doc["current_temp"] | 0.0;
    weather.currentCode = doc["current_code"] | 0;
    weather.todayHigh = doc["today_high"] | 0.0;
    weather.todayLow = doc["today_low"] | 0.0;
    weather.todayCode = doc["today_code"] | 0;
    weather.tomorrowHigh = doc["tomorrow_high"] | 0.0;
    weather.tomorrowLow = doc["tomorrow_low"] | 0.0;
    weather.tomorrowCode = doc["tomorrow_code"] | 0;
  }
  weatherDirty = true;
  return true;
}

void pollWeather() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/weather";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  const int code = http.GET();
  if (code == HTTP_CODE_OK) handleWeatherPayload(http.getString());
  http.end();
}

bool weatherCodeHasRain(int code) {
  return (code >= 51 && code <= 67) || (code >= 80 && code <= 82) || code >= 95;
}

bool weatherCodeHasSnow(int code) {
  return (code >= 71 && code <= 77) || (code >= 85 && code <= 86);
}

void drawWeatherIcon(int cx, int cy, int size, int code) {
  const uint16_t yellow = tft.color565(255, 199, 61);
  const uint16_t cloud = tft.color565(184, 201, 214);
  const uint16_t rain = tft.color565(84, 191, 255);
  const bool clear = code == 0;
  const bool hasSun = code <= 2;
  if (hasSun) {
    const int r = clear ? size * 23 / 100 : size * 17 / 100;
    const int sunY = cy - (clear ? 0 : size * 12 / 100);
    tft.fillCircle(cx, sunY, r, yellow);
    if (clear) {
      for (int i = 0; i < 8; ++i) {
        const float a = i * PI / 4.0f;
        tft.drawLine(cx + cos(a) * size * .32f, cy + sin(a) * size * .32f,
                     cx + cos(a) * size * .45f, cy + sin(a) * size * .45f, yellow);
      }
      return;
    }
  }
  const int y = cy + size * 5 / 100;
  tft.fillRoundRect(cx - size * 36 / 100, y - size * 10 / 100,
                    size * 72 / 100, size * 30 / 100, size * 15 / 100, cloud);
  tft.fillCircle(cx, y - size * 10 / 100, size * 22 / 100, cloud);
  if (weatherCodeHasRain(code) || weatherCodeHasSnow(code)) {
    for (int i = -1; i <= 1; ++i) {
      const int x = cx + i * size * 22 / 100;
      const int y0 = cy + size * 28 / 100;
      const int slant = weatherCodeHasSnow(code) ? 0 : size * 6 / 100;
      tft.drawLine(x, y0, x - slant, cy + size * 43 / 100, rain);
    }
  }
}

void drawWeatherClock() {
  time_t localEpoch = weatherLocalEpoch();
  struct tm localTm = {};
  if (localEpoch > 0) gmtime_r(&localEpoch, &localTm);
  char timeText[16];
  if (localEpoch > 0) {
    snprintf(timeText, sizeof(timeText), "%02d:%02d:%02d", localTm.tm_hour,
             localTm.tm_min, localTm.tm_sec);
  } else {
    strcpy(timeText, "--:--:--");
  }
  tft.fillRect(0, 33, SCREEN_W, 43, TFT_BLACK);
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString(timeText, SCREEN_CX, 39, 4);
}

bool drawWeatherTextStrip(WiFiClient *stream, int x, int y, int w, int h) {
  const size_t bytes = (size_t)w * 2;
  for (int row = 0; row < h; ++row) {
    if (stream->readBytes((uint8_t *)rowBuf, bytes) != bytes) return false;
    tft.pushImage(x, y + row, w, 1, rowBuf);
    yield();
  }
  return true;
}

