dinga1981/esp8266-ai/firmware/src/main.cpp
  html += "<form method='POST' action='/reset-wifi' onsubmit=\"return confirm('清除 WiFi "
          "设置并重启？设备会开启配网热点。');\">";
  html += "<button type='submit' style='background:#dc2626'>重置 WiFi</button>";
  html += "</form>";

  html += "<h2 style='font-size:16px;margin-top:32px'>网络 OTA 固件升级</h2>";
  html += "<p style='font-size:13px;color:#555'>当前版本：<b>" FW_VERSION "</b>。请选择本项目生成的 "
          "ESP8266 firmware.bin。升级不会清除 Wi-Fi、轮播设置或桌宠文件。上传期间请勿断电。</p>";
  html += "<form method='POST' action='/update' enctype='multipart/form-data' "
          "onsubmit=\"return confirm('确认升级固件？上传和重启期间请勿断电。')\">";
  html += "<input type='file' name='firmware' accept='.bin,application/octet-stream' required>";
  html += "<button type='submit' style='background:#059669'>上传并升级</button></form>";

  html += "</body></html>";
  webServer.send(200, "text/html", html);
}

void handleSave() {
  String newHost = webServer.arg("bridge");
  newHost.trim();
  bridgeHost = newHost;
  saveBridgeHost(bridgeHost);
  Serial.printf("[web] bridge host updated to '%s'\n", bridgeHost.c_str());
  webServer.sendHeader("Location", "/");
  webServer.send(303);
}

// ---------- JSON API for the Mac app ----------

const char *displayModeName(DisplayMode m) {
  if (m == MODE_CLAUDE) return "claude";
  if (m == MODE_CODEX) return "codex";
  if (m == MODE_NET) return "net";
  if (m == MODE_MUSIC) return "music";
  if (m == MODE_STOCK) return "stock";
  if (m == MODE_MARKET) return "market";
  if (m == MODE_WEATHER) return "weather";
  return "auto";
}

void handleApiInfo() {
  JsonDocument doc;
  doc["ip"] = WiFi.localIP().toString();
  doc["ssid"] = WiFi.SSID();
  doc["bridge"] = bridgeHost;
  doc["mode"] = displayModeName(displayMode);           // configured mode
  doc["effective"] = displayModeName(effectiveMode());   // what's on screen now
  doc["music_playing"] = statusMusicPlaying;
  doc["showing"] = (currentApp == APP_CLAUDE) ? "claude" : "codex";
  doc["last_update_s"] = everPolled ? (long)((millis() - lastSuccessMs) / 1000) : -1;
  doc["sprite_rev"] = spriteRev;
  doc["brightness"] = brightness;
  doc["wired"] = wiredActive(); // true = data currently arrives over USB serial
  doc["fw"] = FW_VERSION;
  doc["bridge_version"] = bridgeVersion;
  doc["rssi"] = WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : -127;
  doc["free_heap"] = ESP.getFreeHeap();
  doc["uptime_s"] = millis() / 1000UL;
  doc["ota_space"] = ESP.getFreeSketchSpace();
  FSInfo fsInfo;
  if (LittleFS.info(fsInfo)) {
    doc["fs_used"] = fsInfo.usedBytes;
    doc["fs_total"] = fsInfo.totalBytes;
  }
  doc["auto_seconds"] = activeAutoCycleSeconds();
  doc["auto_schedule"] = weatherIsWeekend() ? "weekend" : "weekday";
  JsonArray autoPages = doc["auto_pages"].to<JsonArray>();
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (activeAutoPageMask() & (1U << mode)) autoPages.add(displayModeName((DisplayMode)mode));
  }
  doc["weekday_auto_seconds"] = weekdayAutoCycleSeconds;
  JsonArray weekdayPages = doc["weekday_auto_pages"].to<JsonArray>();
  doc["weekend_auto_seconds"] = weekendAutoCycleSeconds;
  JsonArray weekendPages = doc["weekend_auto_pages"].to<JsonArray>();
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (weekdayAutoPageMask & (1U << mode)) weekdayPages.add(displayModeName((DisplayMode)mode));
    if (weekendAutoPageMask & (1U << mode)) weekendPages.add(displayModeName((DisplayMode)mode));
  }
  JsonObject c = doc["claude"].to<JsonObject>();
  c["status"] = claudeStatus.status;
  c["custom_sprite"] = claudeCustom;
  c["w"] = CLAUDE_SPRITE_W;
  c["h"] = CLAUDE_SPRITE_H;
  JsonObject x = doc["codex"].to<JsonObject>();
  x["status"] = codexStatus.status;
  x["custom_sprite"] = codexCustom;
  x["w"] = CODEX_SPRITE_W;
  x["h"] = CODEX_SPRITE_H;
  String out;
  serializeJson(doc, out);
  webServer.send(200, "application/json", out);
}

void handleApiDisplay() {
  String mode = webServer.arg("mode");
  if (mode == "auto") {
    displayMode = MODE_AUTO;
    resetAutoCyclePosition();
    lastEffectiveMode = MODE_AUTO; // effective carousel pages never equal AUTO
  }
  else if (mode == "claude") displayMode = MODE_CLAUDE;
  else if (mode == "codex") displayMode = MODE_CODEX;
  else if (mode == "net") displayMode = MODE_NET;
  else if (mode == "music") displayMode = MODE_MUSIC;
  else if (mode == "stock") displayMode = MODE_STOCK;
  else if (mode == "market") displayMode = MODE_MARKET;
  else if (mode == "weather") displayMode = MODE_WEATHER;
  else {
    webServer.send(400, "text/plain", "mode must be auto|claude|codex|net|music|stock|market|weather");
    return;
  }
  Serial.printf("[api] display mode = %s\n", mode.c_str());
  if (displayMode == MODE_AUTO) {
    // loop() performs the first selected page's normal transition atomically.
  } else if (displayMode == MODE_NET) {
    netChromeDrawn = false;
    lastNetPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_MUSIC) {
    musicChromeDrawn = false;
    lastMusicPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_STOCK) {
    stockChromeDrawn = false;
    lastStockPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_MARKET) {
    lastMarketPollMs = 0;
    lastMarketFrameVersion = 0; // force a redraw when returning from another page
  } else if (displayMode == MODE_WEATHER) {
    weatherChromeDrawn = false;
    lastWeatherPollMs = 0;
  } else {
    updateActiveApp();
    drawActiveApp(); // unconditional: also repaints over a previous net chart
  }
  webServer.send(200, "text/plain", "ok");
}

bool parseAutoPageList(String pages, uint16_t &mask) {
  mask = 0;
  while (pages.length() > 0) {
    int comma = pages.indexOf(',');
    String page = comma >= 0 ? pages.substring(0, comma) : pages;
    pages = comma >= 0 ? pages.substring(comma + 1) : "";
    page.trim();
    if (page == "codex") mask |= 1U << MODE_CODEX;
    else if (page == "music") mask |= 1U << MODE_MUSIC;
    else if (page == "stock") mask |= 1U << MODE_STOCK;
    else if (page == "market") mask |= 1U << MODE_MARKET;
    else if (page == "weather") mask |= 1U << MODE_WEATHER;
    else if (page.length() > 0) return false;
  }
  return mask != 0;
}

